app/views/admin/event_submissions/show.html.erb

            <li class="list-group-item">Durée : <%= @event.duration%> minutes</li>
            <li class="list-group-item">Nombre de participants : <%= @event.users.length %></li>
---
SELECT "users".* FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = $1  [["event_id", 32]]