app/controllers/admin/event_submissions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
  	@event = finder
    @user = User.find(@event.user_id)

UPDATE "events" SET "validated" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["validated", true], ["updated_at", "2020-08-16 22:14:30.486715"], ["id", 32]]
---
  def update
  	puts params
  	event = finder
  	event.update(params.permit(:validated))