app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = $1  [["user_id", 26]]
SELECT  1 AS one FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = $1 LIMIT $2  [["user_id", 21], ["LIMIT", 1]]
---
<p>Email : <%= @user.email %></p>
<% if !@user.events.empty? %>