app/controllers/application_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
def finder
  Event.find(params[:id])