app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 27], ["event_id", 28], ["created_at", "2020-08-14 15:41:04.268627"], ["updated_at", "2020-08-14 15:41:04.268627"]]
---
def create
  @event = event_finder
  Attendance.create(event: @event, user: current_user)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
def event_finder
  Event.find(params[:event_id])