app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(events_params)
    @event.user_id = current_user.id
    if @event.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def show
    @event = finder
    @user = User.find(@event.user_id)

UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "boire beaucoup"], ["updated_at", "2020-08-14 15:35:15.942465"], ["id", 27]]
---
  def update
    @event = finder
    @event.update(events_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 28]]
---
  def destroy
    event = finder
    event.delete

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
def finder
  Event.find(params[:id])