app/controllers/users_controller.rb

  def show
    @user = user_finder
    @events = Event.where(user_id: @user.id)
---
SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 LIMIT $2  [["user_id", 25], ["LIMIT", 1]]

  def update
    @user = user_finder
    @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "hugo"], ["last_name", "maa"], ["description", "hello world"], ["updated_at", "2020-08-11 16:53:20.824182"], ["id", 21]]

  def user_finder
    User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]