app/views/attendances/index.html.erb

         </ul>
  		<% @event.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = $1  [["event_id", 27]]